/* package up error # */
"error %1$d" = "错误 %1$d";
"error %1$#x" = "错误 %1$#x";
/* errno error 0 */
"Unknown error: 0" = "未知错误：0";

/* errno error 1 */
"Operation not permitted" = "操作不被允许";

/* errno error 2 */
"No such file or directory" = "无此文件或目录";

/* errno error 3 */
"No such process" = "无此进程";

/* errno error 4 */
"Interrupted system call" = "被中断的系统调用";

/* errno error 5 */
"Input/output error" = "输入/输出错误";

/* errno error 6 */
"Device not configured" = "设备未配置";

/* errno error 7 */
"Argument list too long" = "自变量列表过长";

/* errno error 8 */
"Exec format error" = "执行格式错误";

/* errno error 9 */
"Bad file descriptor" = "错误的文件描述符";

/* errno error 10 */
"No child processes" = "无子进程";

/* errno error 11 */
"Resource deadlock avoided" = "资源死锁被避开";

/* errno error 12 */
"Cannot allocate memory" = "不能分配内存";

/* errno error 13 */
"Permission denied" = "权限被拒绝";

/* errno error 14 */
"Bad address" = "错误地址";

/* errno error 15 */
"Block device required" = "需要块设备";

/* errno error 16 */
"Resource busy" = "资源忙";

/* errno error 17 */
"File exists" = "文件已经存在";

/* errno error 18 */
"Cross-device link" = "跨设备链接";

/* errno error 19 */
"Operation not supported by device" = "操作不被设备支持";

/* errno error 20 */
"Not a directory" = "不是目录";

/* errno error 21 */
"Is a directory" = "是目录";

/* errno error 22 */
"Invalid argument" = "无效的自变量";

/* errno error 23 */
"Too many open files in system" = "系统中打开的文件过多";

/* errno error 24 */
"Too many open files" = "打开的文件过多";

/* errno error 25 */
"Inappropriate ioctl for device" = "不适当的设备 ioctl";

/* errno error 26 */
"Text file busy" = "文本文件忙";

/* errno error 27 */
"File too large" = "文件过大";

/* errno error 28 */
"No space left on device" = "设备上无剩余空间";

/* errno error 29 */
"Illegal seek" = "非法查找";

/* errno error 30 */
"Read-only file system" = "只读文件系统";

/* errno error 31 */
"Too many links" = "过多链接";

/* errno error 32 */
"Broken pipe" = "断裂管道";

/* errno error 33 */
"Numerical argument out of domain" = "数值自变量超过范围";

/* errno error 34 */
"Result too large" = "结果过大";

/* errno error 35 */
"Resource temporarily unavailable" = "资源暂时不可用";

/* errno error 36 */
"Operation now in progress" = "操作正在进行";

/* errno error 37 */
"Operation already in progress" = "操作已经进行";

/* errno error 38 */
"Socket operation on non-socket" = "非 Socket 上的 Socket 操作";

/* errno error 39 */
"Destination address required" = "需要目的地址";

/* errno error 40 */
"Message too long" = "信息过长";

/* errno error 41 */
"Protocol wrong type for socket" = "用于 Socket 的错误协议类型";

/* errno error 42 */
"Protocol not available" = "协议不可用";

/* errno error 43 */
"Protocol not supported" = "协议不被支持";

/* errno error 44 */
"Socket type not supported" = "不被支持的 Socket 类型";

/* errno error 45 */
"Operation not supported" = "操作不被支持";

/* errno error 46 */
"Protocol family not supported" = "协议族不被支持";

/* errno error 47 */
"Address family not supported by protocol family" = "协议族不支持地址族";

/* errno error 48 */
"Address already in use" = "地址已经被占用";

/* errno error 49 */
"Can't assign requested address" = "不能分配请求的地址";

/* errno error 50 */
"Network is down" = "网络已关闭";

/* errno error 51 */
"Network is unreachable" = "网络无法连接";

/* errno error 52 */
"Network dropped connection on reset" = "重置时网络断开了连接";

/* errno error 53 */
"Software caused connection abort" = "软件导致连接中止";

/* errno error 54 */
"Connection reset by peer" = "连接被对方重置";

/* errno error 55 */
"No buffer space available" = "无缓冲区空间可用";

/* errno error 56 */
"Socket is already connected" = "Socket 已连接";

/* errno error 57 */
"Socket is not connected" = "Socket 未连接";

/* errno error 58 */
"Can't send after socket shutdown" = "关闭 Socket 后不能发送";

/* errno error 59 */
"Too many references: can't splice" = "过多的引用：不能接合";

/* errno error 60 */
"Operation timed out" = "操作超时";

/* errno error 61 */
"Connection refused" = "连接被拒绝";

/* errno error 62 */
"Too many levels of symbolic links" = "过多的符号链接级别";

/* errno error 63 */
"File name too long" = "文件名过长";

/* errno error 64 */
"Host is down" = "主机已关闭";

/* errno error 65 */
"No route to host" = "无到主机的路由";

/* errno error 66 */
"Directory not empty" = "目录非空";

/* errno error 67 */
"Too many processes" = "过多的进程";

/* errno error 68 */
"Too many users" = "过多的用户";

/* errno error 69 */
"Disc quota exceeded" = "超过光盘配额";

/* errno error 70 */
"Stale NFS file handle" = "旧的 NFS 文件处理";

/* errno error 71 */
"Too many levels of remote in path" = "路径中的远程级别过多";

/* errno error 72 */
"RPC struct is bad" = "RPC 结构错误";

/* errno error 73 */
"RPC version wrong" = "RPC 版本错误";

/* errno error 74 */
"RPC prog. not avail" = "RPC 程序不可用";

/* errno error 75 */
"Program version wrong" = "程序版本错误";

/* errno error 76 */
"Bad procedure for program" = "程序的错误过程";

/* errno error 77 */
"No locks available" = "没有锁信息";

/* errno error 78 */
"Function not implemented" = "功能未实现";

/* errno error 79 */
"Inappropriate file type or format" = "不适当的文件类型或格式";

/* errno error 80 */
"Authentication error" = "鉴定错误";

/* errno error 81 */
"Need authenticator" = "需要鉴定程序";

/* errno error 82 */
"Device power is off" = "设备电源已关闭";

/* errno error 83 */
"Device error" = "设备错误";

/* errno error 84 */
"Value too large to be stored in data type" = "数值过大，不能储存在数据类型中";

/* errno error 85 */
"Bad executable (or shared library)" = "错误的可执行文件（或共享库）";

/* errno error 86 */
"Bad CPU type in executable" = "可执行文件中的 CPU 类型不正确";

/* errno error 87 */
"Shared library version mismatch" = "共享库版本不匹配";

/* errno error 88 */
"Malformed Mach-o file" = "变体 Mach-o 文件";

/* errno error 89 */
"Operation canceled" = "操作已取消";

/* errno error 90 */
"Identifier removed" = "标识符已移去";

/* errno error 91 */
"No message of desired type" = "无所需类型的信息";

/* errno error 92 */
"Illegal byte sequence" = "非法的字节序列";

/* errno error 93 */
"Attribute not found" = "找不到属性";

/* errno error 94 */
"Bad message" = "错误信息";

/* errno error 95 */
"EMULTIHOP (Reserved)" = "EMULTIHOP（保留）";

/* errno error 96 */
"No message available on STREAM" = "在 STREAM 中无可用信息";

/* errno error 97 */
"ENOLINK (Reserved)" = "ENOLINK（保留）";

/* errno error 98 */
"No STREAM resources" = "无 STREAM 资源";

/* errno error 99 */
"Not a STREAM" = "不是 STREAM";

/* errno error 100 */
"Protocol error" = "协议错误";

/* errno error 101 */
"STREAM ioctl timeout" = "STREAM ioctl 超时";

/* errno error 102 */
"Operation not supported on socket" = "套接字不支持此操作";

/* errno error 103 */
"Policy not found" = "策略找不到";
